## Production: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                   NAME                   |
|----------|------------------------------------------|
| recreate | `aws_ecs_task_definition.wordpress_task` |
| update   | `aws_ecs_service.wordpress_service`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:472286471787:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:54" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:54" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - environment      = []
                  - mountPoints      = []
                    name             = "apache"
                    # (5 unchanged attributes hidden)
                },
              ~ {
                  - cpu              = 0
                  ~ image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v3.10.5" -> "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v3.10.6"
                  - mountPoints      = []
                    name             = "wordpress"
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 54 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_ecs_cluster.wordpress,
  on ecs.tf line 4, in resource "aws_ecs_cluster" "wordpress":
   4: resource "aws_ecs_cluster" "wordpress" {

Use the aws_ecs_cluster_capacity_providers resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.wordpress_ecs_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.wordpress_service"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.wordpress_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_ecr_image"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_secret_value"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs_events_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.wordpress_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_access_key_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_secret_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_list_manager_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.encryption_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.jwt_auth_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.list_manager_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
